[
  {
    "title": "Jerry Swisshelm",
    "date": "2020-01-10T05:00:00.000Z",
    "content": "We love Linda and Breeze! We are blessed to have them as our personal trainers. Their knowledge, encouragement, and smiling faces make our day!",
    "publish": true,
    "featured": true
  },
  {
    "title": "Diane Robinson",
    "date": "2019-11-13T05:00:00.000Z",
    "content": "The personal one on one training. Linda and Breeze have such a positive attitude and true passion to see you reach your goals you can’t help but be inspired to reach for the stars.",
    "publish": true,
    "featured": true
  },
  {
    "title": "Elke Martin",
    "date": "2019-10-30T04:00:00.000Z",
    "content": "Since we (61 year-old me and my 65-year-old husband) started training with Linda and Breeze, we are stronger, more toned, more flexible and feeling healthier than ever! Strongly recommend this dynamic duo, whether you are interested in gaining muscle, endurance, better nutrition habits or need a life change. They'll customize sessions, energize you (and you'll have an awesome time while pursuing your fitness goals). Good people with a great track record of success.",
    "publish": true,
    "featured": true
  },
  {
    "title": "Cynthia Feldman",
    "date": "2019-10-23T04:00:00.000Z",
    "content": "Linda is amazing and motivates me in me fitness goals as well as life goals. Linda knows how to look at the big picture, not just the 45 mins of the lesson. The studio is comfortable and inviting. Totally recommend",
    "publish": true,
    "featured": true
  },
  {
    "title": "Leslie L. Lovingood",
    "date": "2019-10-23T04:00:00.000Z",
    "content": "Sweet Strength Fitness is the best that I have ever belonged to! Linda is a ray of sunshine and makes me feel great when I walk in the door. She listens to what I need and want from my workouts. Breeze is also the greatest! They are the best, they work together, to help anyone reach their goals, better fitness, strength! I highly recommend Sweet Strength!! Also, for nutrition and mental health! ❤️❤️❤️",
    "publish": true,
    "featured": true
  },
  {
    "title": "Peter Cretella",
    "date": "2019-10-23T04:00:00.000Z",
    "content": "The best decision I made since retiring in 2016 was to engage the services of Breeze and Linda at Sweet Strength. It has been life-changing. It is impossible not to have their passion, dedication and genuine caring for their clients make a positive impact on your life! I love these folks and intend to be a client for life!",
    "publish": true,
    "featured": false
  },
  {
    "title": "Judy G. Stephens",
    "date": "2019-10-22T04:00:00.000Z",
    "content": "Do I recommend Sweet Strength Studio? Absolutely! I’m 65 and had not exercised on a regular basis in quite awhile. I luckily found Linda and she now has me on a good path back to becoming fit. If you want someone who will motivate you, listen to you, and give you advice in a non-judgemental way, then come see Linda Timmons. She is always learning and continuing to educate herself in fitness and nutrition. It’s great to be able to walk in to the studio, be warmly greeted and know that a caring person will be with you every step of the way encouraging you to be your very best!",
    "publish": true,
    "featured": false
  },
  {
    "title": "Heather Long Chadwick",
    "date": "2019-10-21T04:00:00.000Z",
    "content": "Love this place! Linda and Breeze are amazing coaches. I am lucky to get to work out here. Give them a try! You will not be disappointed. 👍💯👏",
    "publish": true,
    "featured": false
  },
  {
    "title": "Shaun McDonald",
    "date": "2019-10-20T04:00:00.000Z",
    "content": "Thank you Breeze for helping me with my form and for all the great advise. It's great having someone so knowledgeable work with me. teaching me so much. I cannot thank you guy's enough.",
    "publish": true,
    "featured": false
  },
  {
    "title": "Sheri Richardson Richard",
    "date": "2019-10-06T04:00:00.000Z",
    "content": "Best 2 trainers in Charleston, SC. They are both so passionate about their clients & their job!! Highly, Highly recommended",
    "publish": true,
    "featured": false
  },
  {
    "title": "Michelle Hudson",
    "date": "2020-01-22T05:00:00.000Z",
    "content": "Sweet Strength is a true gem! I have trained with several trainers over the course of my life but Linda and Breeze definitely stand out!! Both are very passionate about their time with clients, fitness, and nutrition! I personally benefit from a more one-on-one client/trainer relationship and you will find that at Sweet Strength. You will be motivated, challenged, learn to love you and want to better yourself in all aspects! Give Linda and Breeze a try!! You will not be disappointed!!!",
    "publish": true,
    "featured": false
  },
  {
    "title": "Victoria Lazar-Breault",
    "date": "2019-10-30T04:00:00.000Z",
    "content": "My husband and I love Linda and Sweet Strength Fitness! Breeze and Linda have such a passion for what they do that it actually makes working out fun! Looking forward to achieving our goals with both of their help.",
    "publish": true,
    "featured": false
  },
  {
    "title": "Elke Martin",
    "date": "2019-10-30T04:00:00.000Z",
    "content": "Since we (61 year-old me and my 65-year-old husband) started training with Linda and Breeze, we are stronger, more toned, more flexible and feeling healthier than ever! Strongly recommend this dynamic duo, whether you are interested in gaining muscle, endurance, better nutrition habits or need a life change. They’ll customize sessions, energize you (and you’ll have an awesome time while pursuing your fitness goals). Good people with a great track record of success.",
    "publish": true,
    "featured": false
  },
  {
    "title": "Krystle Edwards",
    "date": "2019-10-30T04:00:00.000Z",
    "content": "Been in and out of gyms my whole adult life; sometimes there would be months in between visits - so I decided to inquire about having a personal trainer to keep me motivated. I had met Linda Timmons over ten plus years ago and knew how dedicated she was to wellness and fitness, and thought she would be the perfect fit. I started training with Linda in the summer of that year and still see her twice a week today. Linda helps me stay focused and inspires me to reach for my goals. I thoroughly enjoy and look forward to her training me during the week. It helps keep me fit, while de-stressed as well. Linda always pushes and drives me to do my best. I believe Linda knows what her client’s individual needs are, knows how much to push them to get the results that we are looking for. I always leave feeling better than when I walked in. Always. It is nice to have someone beside you, to keep you on the right path and be your cheerleader. Always smiling and positive. I consider her not only my personal trainer, but a good friend as well. Thank you, Linda - for keeping me focused and on the path to great fitness and wellness!",
    "publish": true,
    "featured": false
  },
  {
    "title": "Laurie Le Febvre",
    "date": "2019-10-30T04:00:00.000Z",
    "content": "I had no direction in life for a long time. Then - I started coaching sessions with Linda. She helped me with self esteem, toxic thoughts, problem solving, and controlling my emotions and fears, thinking outside of the box…just to name a few. In just a short time, I learned that I chose where I am in life today with the ability to change where I am to be where I want to be by setting goals. One of my goals was to start training and I am now. Life does not have to be hard. It is amazing what we can accomplish in life! I have changed in many ways and awake now every morning with an &#8220;I Can &amp; Will Do&#8221; attitude. I am at peace and am so thankful for Linda and Sweet Strength.",
    "publish": true,
    "featured": false
  },
  {
    "title": "Colette Thomas",
    "date": "2019-10-30T04:00:00.000Z",
    "content": "When I began my coaching and training sessions with Linda I was a mess. Really - a big, giant, unfocused, insecure mess. And Linda patiently, lovingly and skillfully guided me in setting attainable goals, encouraging me and helping me to create boundaries, building me up, not tearing me down. When we started working out, it was awesome! She gave me a positive physical outlet for my excess energy to benefit me in all areas. It helped me focus, work towards my goals, and improved my self image. I loved it! It was challenging and fun. I felt energized and strong. And sure, I would gripe a bit sometimes - but she pushed me in a good way. Life changed dramatically for me that year. I had been flailing; with Linda’s help - I began to find me again. Sweet Strength is empowering, encouraging and uplifting . . . because that’s what Linda is. I highly recommend both!",
    "publish": true,
    "featured": false
  },
  {
    "title": "JH",
    "date": "2019-10-30T04:00:00.000Z",
    "content": "I was stuck and lived in daily torment. I knew what the problem was - it was me. I didn’t know what to do about it except to cry out to Jesus for help. I would wake up every morning and ask Jesus, “Please help me lose weight. Please help me go to You rather than food to meet my needs.” I did this for years. I was morbidly obese with nothing to stop me from getting bigger. It was scary. Then, I had happened to have breakfast with a dear friend - Linda Timmons, whom I hadn’t seen in a couple of years. She told me she had started a new business doing wellness coaching and told me a little bit about how it worked. My heart leapt, I dared to think that maybe this was Jesus answering my prayers. I began to meet with Linda totally by faith. She would ask me questions that made me think, really think. She constantly challenged me in my thinking . . . It took a little over three months and I had lost 22 pounds and gone down an unbelievable 45 points on cholesterol. I’m now exercising regularly, doing things I’ve never done before, never thought I could. My husband has commented it is so impressive to him of the total change in my life.",
    "publish": true,
    "featured": false
  },
  {
    "title": "Anja Evenson",
    "date": "2019-10-30T04:00:00.000Z",
    "content": "Linda Timmons could not have shown up into my life at a better time, and I could not have asked for a better life coach . . . in finding my true purpose in life, I was unsure of how to pursue my goals, where to start, what my big dream even really was ~ with Linda’s guidance, my faith strengthened, goals became clear, and I landed a dream job working specifically within my passion. If you are willing to open your mind and accept challenges, she will teach you how to overcome and grow through them. The opportunities presented have changed the way I view myself, the world, and the people around me, and will forever have an impact on how I live my life. I can’t wait to see what my future has in store. Thank you, Linda for an amazing journey.",
    "publish": true,
    "featured": false
  },
  {
    "title": "Lynn Schedule",
    "date": "2019-10-30T04:00:00.000Z",
    "content": "I love my Trainer/Wellness coach. I’m learning so much about exercise and eating! I feel this is one of God’s lessons he put in front of me after going through sickness. Linda is there for all people - sick and not sick. You can be thin and still be unhealthy, you can be heavy and need to have someone from the outside look in to help. And - let’s not call it dieting - let’s call it a way of life and do it for life. She is a very Godly woman, and YES she will pray for you and with you.",
    "publish": true,
    "featured": false
  },
  {
    "title": "Beth Brunson",
    "date": "2019-10-30T04:00:00.000Z",
    "content": "I was pretty much at the end of my rope with no idea where to turn. My body had gone terribly downhill over the previous two years, gaining weight while losing muscle power and tone. Plus, I was in pain all the time and had to cut back on work time as I couldn’t stand for eight hours required. Some days I couldn’t even walk because of whatever was wrong with my knee . . . Then I cam to Linda and we decided I could take control of my body. Working with Sweet Strength three times per week, for a few weeks I had a combination of Wellness training and personal training, then went to all personal training. It’s absolutely amazing how I have improved! Strong all over. My knee is so much better. I’m doing squats and all kinds of things like that! My whole body has changed. My eating habits have changed. My outlook on life is stronger and brighter. I’m determined to never stop taking care of myself again! Sweet Strength taught me so much about foods, my body and about myself mentally and emotionally!",
    "publish": true,
    "featured": false
  }
]